// @strict-types

#Область СлужебныеПроцедурыИФункции

// см. ОтчетыКлиентПереопределяемый.ПослеФормирования
&НаКлиенте
Процедура ДСП_ПослеФормирования(ФормаОтчета, ОтчетСформирован) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ПослеФормирования");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработкаРасшифровки
&НаКлиенте
Процедура ДСП_ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработкаРасшифровки");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработкаДополнительнойРасшифровки
&НаКлиенте
Процедура ДСП_ОбработкаДополнительнойРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработкаДополнительнойРасшифровки");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработчикКоманды
&НаКлиенте
Процедура ДСП_ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработчикКоманды");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ПриНачалеВыбораЗначений
&НаКлиенте
Процедура ПриНачалеВыбораЗначений(ФормаОтчета, УсловияВыбора, ОповещениеОЗакрытии, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ПриНачалеВыбораЗначений");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработкаВыбора
&НаКлиенте
Процедура ДСП_ОбработкаВыбора(ФормаОтчета, ВыбранноеЗначение, ИсточникВыбора, Результат) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработкаВыбора");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработкаВыбораТабличногоДокумента
&НаКлиенте
Процедура ДСП_ОбработкаВыбораТабличногоДокумента(ФормаОтчета, Элемент, Область, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработкаВыбораТабличногоДокумента");
	
КонецПроцедуры

// см. ОтчетыКлиентПереопределяемый.ОбработкаОповещения
&НаКлиенте
Процедура ДСП_ОбработкаОповещения(ФормаОтчета, ИмяСобытия, Параметр, Источник, ОповещениеОбработано) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ОбработкаОповещения");
	
КонецПроцедуры

//см. ОтчетыКлиентПереопределяемый.ПриНажатииКнопкиВыбораПериода
&НаКлиенте
Процедура ДСП_ПриНажатииКнопкиВыбораПериода(ФормаОтчета, Период, СтандартнаяОбработка, ОбработчикРезультата) Экспорт
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("ПриНажатииКнопкиВыбораПериода");
	
КонецПроцедуры

#КонецОбласти
