// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры открытия объекта ключевой операции.
// 
// Параметры:
//  КлючеваяОперация - СправочникСсылка.КлючевыеОперации
// 
// Возвращаемое значение:
//  Структура:
// * ИмяФормы - Строка - Имя открываемой формы
// * ПараметрыФормы - Структура - Параметры открываемой формы
Функция ПараметрыОткрытияОбъектаКлючевойОперации(КлючеваяОперация) Экспорт
	
	Возврат Создать().ПараметрыОткрытияОбъектаКлючевойОперации(КлючеваяОперация);
	
КонецФункции

#КонецОбласти

#КонецЕсли