// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// см. ДСП_КлиентСервер.НастройкиРасширения
Функция НастройкиРасширения(Знач НужноОбновить = Неопределено) Экспорт

	КэшированныеНастройки = ДСП_Перем_КэшНастройкиРасширения; // см. ДСП_КлиентСервер.НовыйКэшированныеНастройкиРасширения
	
	Если НужноОбновить = Неопределено Тогда
		НужноОбновить = ДСП_КлиентСервер.НастройкиНужноОбновить(КэшированныеНастройки);
	КонецЕсли;
	
	Если НужноОбновить Тогда
		НастройкиРасширения = ДСП_ВызовСервера.НастройкиРасширения(Истина); //см. НастройкиРасширения
		ДСП_Перем_КэшНастройкиРасширения = ДСП_КлиентСервер.НовыйКэшированныеНастройкиРасширения(НастройкиРасширения);
	Иначе
		НастройкиРасширения = КэшированныеНастройки.Настройки;
	КонецЕсли;
	
	Возврат НастройкиРасширения;
	
КонецФункции

#КонецОбласти