// @strict-types

#Область ОписаниеПеременных

Перем ДСП_Перем_КэшНастройкиРасширения Экспорт; //см. ДСП_КлиентСервер.НовыйКэшированныеНастройкиРасширения

#КонецОбласти

#Область ОбработчикиСобытий

//@skip-check bsl-legacy-check-module-extension - Баг ЕДТ
&После("ПередНачаломРаботыСистемы")
Процедура ДСП_ПередНачаломРаботыСистемы(Отказ)
	
	ДСП_КлиентСервер.НастройкиРасширения(Истина);
	
КонецПроцедуры

//@skip-check bsl-legacy-check-pragma-for-unused-method - Баг ЕДТ
&Перед("ПередЗавершениемРаботыСистемы")
Процедура ДСП_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	Если ДСП_КлиентСервер.Настройка_ОценкаПроизводительности_ФиксироватьЗамерыПередЗавершениемСеанса(Ложь)
		И ОценкаПроизводительностиКлиент.ДСП_ЕстьЗамерыДляЗаписи() Тогда
		ОценкаПроизводительностиКлиент.ДСП_ЗафиксироватьЗамерыАсинх();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
