
#Область ПрограммныйИнтерфейс

// Общий модуль ДСП_ВызовСервера
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ДСП_ВызовСервера() Экспорт
	
	Возврат ДСПТ_Движок.ОбщийМодуль("ДСП_ВызовСервера");
	
КонецФункции

// Общий модуль ДСП_КлиентСервер
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ДСП_КлиентСервер() Экспорт
	
	Возврат ДСПТ_Движок.ОбщийМодуль("ДСП_КлиентСервер");
	
КонецФункции

#Если Сервер Тогда

// Общий модуль ДСП_ПовтИсп
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ДСП_ПовтИсп() Экспорт
	
	Возврат ДСПТ_Движок.ОбщийМодуль("ДСП_ПовтИсп");
	
КонецФункции

// Общий модуль ДСП_Сервер
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ДСП_Сервер() Экспорт
	
	Возврат ДСПТ_Движок.ОбщийМодуль("ДСП_Сервер");
	
КонецФункции

#Иначе

// Общий модуль ДСП_Клиент
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ДСП_Клиент() Экспорт
	
	Возврат ДСПТ_Движок.ОбщийМодуль("ДСП_Клиент");
	
КонецФункции

#КонецЕсли

#КонецОбласти
