// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ПараметрыОткрытияОбъектаКлючевойОперации(ПараметрКоманды);
	Если ЗначениеЗаполнено(ПараметрыОткрытия.ИмяФормы) Тогда
	
		Попытка
			ОткрытьФорму(ПараметрыОткрытия.ИмяФормы, ПараметрыОткрытия.ПараметрыФормы);
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// см. Обработки.ДСП_ИменованияКлючевыхОпераций.ПараметрыОткрытияОбъектаКлючевойОперации
&НаСервере
Функция ПараметрыОткрытияОбъектаКлючевойОперации(КлючеваяОперация)
	
	Возврат Обработки.ДСП_ИменованияКлючевыхОпераций.ПараметрыОткрытияОбъектаКлючевойОперации(КлючеваяОперация);
	
КонецФункции

#КонецОбласти
