
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ДСПТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("НастройкиНужноОбновить")
			.ДобавитьТест("Тест_НастройкиНужноОбновить")
				//Частота обновления | Минут прошло | Нужно ли обновить
				.СПараметрами( 1,  1, Ложь)
				.СПараметрами( 9,  5, Ложь)
				.СПараметрами( 9, -5, Ложь)
				.СПараметрами( 5,  9, Истина)
				.СПараметрами(-1,  1, Истина)
		.ДобавитьТестовыйНабор("НастройкиНужноОбновить")
			.ДобавитьТест("Тест_НастройкиРасширения_БезОбновления")
			.ДобавитьТест("Тест_НастройкиРасширения_СОбновлением")
	;

КонецПроцедуры

#Область Тесты

#Область НастройкиНужноОбновить

Процедура Тест_НастройкиНужноОбновить(ЧастотаОбновленияНастроек, РазницаВМинутах, ОжидаемыйРезультат) Экспорт

	Перем ЮТест;
	ЮТест = ДСПТ_Движок.ЮТест();
	Модуль = ТестируемыйМодуль();
	
	КэшированныеНастройки = КэшированныеНастройкиДляПроверки(ЧастотаОбновленияНастроек, РазницаВМинутах);
	Результат = Модуль.НастройкиНужноОбновить(КэшированныеНастройки);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемыйРезультат);
		
КонецПроцедуры

#КонецОбласти

#Область НастройкиРасширения

Процедура Тест_НастройкиРасширения_БезОбновления() Экспорт

	Перем ЮТест;
	ЮТест = ДСПТ_Движок.ЮТест();
	Модуль = ТестируемыйМодуль();
	
	//Первая версия настроек
	Настройки1 = Модуль.НастройкиРасширения();
	Настройки2 = Модуль.НастройкиРасширения();
	Настройки3 = Модуль.НастройкиРасширения(Ложь);
	
	ЮТест.ОжидаетЧто(Настройки1 = Настройки2).ЭтоИстина();
	ЮТест.ОжидаетЧто(Настройки2 = Настройки3).ЭтоИстина();
		
КонецПроцедуры

Процедура Тест_НастройкиРасширения_СОбновлением() Экспорт

	Перем ЮТест;
	ЮТест = ДСПТ_Движок.ЮТест();
	Модуль = ТестируемыйМодуль();
	
	Настройки1 = Модуль.НастройкиРасширения();
	
	Настройки2 = Модуль.НастройкиРасширения(Истина);
	
	Настройки2.Общие.ЧастотаОбновленияНастроек = -1;
	Настройки3 = Модуль.НастройкиРасширения();
	
	ЮТест.ОжидаетЧто(Настройки1 = Настройки2).ЭтоЛожь();
	ЮТест.ОжидаетЧто(Настройки2 = Настройки3).ЭтоЛожь();
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Тесты

Функция КэшированныеНастройкиДляПроверки(ЧастотаОбновленияНастроек, РазницаВМинутах)
	
	Модуль = ТестируемыйМодуль();
	НастройкиРасширения = Модуль.НовыйНастройкиРасширения();
	КэшированныеНастройки = Модуль.НовыйКэшированныеНастройкиРасширения(НастройкиРасширения);
	КэшированныеНастройки.Настройки.Общие.ЧастотаОбновленияНастроек = ЧастотаОбновленияНастроек;
	КэшированныеНастройки.ТехническиеДанные.ДатаОбновления = Модуль.ДатаСеанса() - (60 * РазницаВМинутах);
	Возврат КэшированныеНастройки;
	
КонецФункции

#КонецОбласти

#Область Служебное

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ДСПТ_Модули.ДСП_КлиентСервер();
	
КонецФункции

#КонецОбласти

#КонецОбласти