
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ДСПТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("НастройкиНужноОбновить")
			.ДобавитьТест("Тест_НастройкиНужноОбновить")
				.СПараметрами(1,  1, Ложь)
				.СПараметрами(9,  5, Ложь)
				.СПараметрами(9, -5, Ложь)
				.СПараметрами(5,  9, Истина)
	;

КонецПроцедуры

#Область Тесты

#Область НастройкиНужноОбновить

Процедура Тест_НастройкиНужноОбновить(ЧастотаОбновленияНастроек, РазницаВМинутах, ОжидаемыйРезультат) Экспорт

	Перем ЮТест;
	ЮТест = ДСПТ_Движок.ЮТест();
	Модуль = ТестируемыйМодуль();
	
	КэшированныеНастройки = КэшированныеНастройкиДляПроверки(ЧастотаОбновленияНастроек, РазницаВМинутах);
	Результат = Модуль.НастройкиНужноОбновить(КэшированныеНастройки);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемыйРезультат);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Тесты

Функция КэшированныеНастройкиДляПроверки(ЧастотаОбновленияНастроек, РазницаВМинутах)
	
	Модуль = ТестируемыйМодуль();
	НастройкиРасширения = Модуль.НовыйНастройкиРасширения();
	КэшированныеНастройки = Модуль.НовыйКэшированныеНастройкиРасширения(НастройкиРасширения);
	КэшированныеНастройки.Настройки.Общие.ЧастотаОбновленияНастроек = ЧастотаОбновленияНастроек;
	КэшированныеНастройки.ТехническиеДанные.ДатаОбновления = Модуль.ДатаСеанса() - (60 * РазницаВМинутах);
	Возврат КэшированныеНастройки;
	
КонецФункции

#КонецОбласти

#Область Служебное

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ДСПТ_Модули.ДСП_КлиентСервер();
	
КонецФункции

#КонецОбласти

#КонецОбласти