
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке
Функция СведенияОВнешнейОбработке() Экспорт
	
	МетаданныеОтчета = Метаданные();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
    ПараметрыРегистрации.Версия = "1.1.1";
    ПараметрыРегистрации.БезопасныйРежим = Истина;	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = МетаданныеОтчета.Представление();
    НоваяКоманда.Идентификатор = МетаданныеОтчета.Имя;
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    НоваяКоманда.ПоказыватьОповещение = Ложь;
        
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
// 			Неопределено, когда вызов без контекста.
// КлючВарианта - Строка, Неопределено - Имя предопределенного
// 				или уникальный идентификатор пользовательского варианта отчета.
// 				Неопределено, когда вызов без контекста.
// Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
	РасширенныеНастройки = ВариантыОтчетовКлиентСервер.ДСП_НовыйНастройкиОтчета();
	РасширенныеНастройки.ФормаКлиентскихСобытий = Метаданные().Формы.ДСП_ФормаКлиентскихСобытий.Имя;
	
	РасширенныеСобытия = РасширенныеНастройки.События;
	Для Каждого КлючИЗначение Из РасширенныеСобытия Цикл
		РасширенныеСобытия[КлючИЗначение.Ключ] = Истина;
	КонецЦикла;
	
	ВариантыОтчетовКлиентСервер.ДСП_ВнедритьНастройки(Настройки, РасширенныеНастройки);
	
КонецПроцедуры

// см. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ДобавитьТестовуюКоманду(Форма);
 	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТестовуюКоманду(Форма)
	
	Если Форма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "ТестоваяКоманда";
	Если Форма.Команды.Найти(ИмяКоманды) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Действие = "Подключаемый_Команда";
	Команда.Заголовок = НСтр("ru = 'Тестовая команда'");
	ОтчетыСервер.ВывестиКоманду(Форма, Команда, "Главное");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
