// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ОписанияТипов

// Настройки расширения.
// 
// Возвращаемое значение:
//  Структура:
// * ОценкаПроизводительности - см. НастройкиПодсистемыОценкаПроизводительности 
Функция НастройкиРасширения() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОценкаПроизводительности", НастройкиПодсистемыОценкаПроизводительности());
	
	Возврат Результат;
	
КонецФункции

// Настройки подсистемы "Оценка производительности".
// 
// Возвращаемое значение:
//  Структура:
// * Использовать - Булево - Использовать ли доработки подсистемы 
// * ФиксироватьБыстрыеФормированияОтчетов - Булево - Нужно ли фиксировать "быстрые" формирования отчетов в замерах (БСП не фиксирует)
Функция НастройкиПодсистемыОценкаПроизводительности() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Использовать", Ложь);
	Результат.Вставить("ФиксироватьБыстрыеФормированияОтчетов", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Ключи

Функция КлючНастроекРасширения() Экспорт
	
	Возврат "Настройки";
	
КонецФункции

Функция ИмяРасширения() Экспорт
	
	Возврат "ДоработкиСтандартныхПодсистем";
	
КонецФункции

#КонецОбласти

#КонецОбласти