// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет наличие замеров времени для записи.
// 
// Возвращаемое значение:
//  Булево
Функция ДСП_ЕстьЗамерыДляЗаписи() Экспорт
	
	ЗамерыДляЗаписи = ОценкаПроизводительностиЗамерВремени();
	Возврат ЗамерыДляЗаписи <> Неопределено И ЗначениеЗаполнено(ЗамерыДляЗаписи.ЗамерыЗавершенные);
	
КонецФункции

Асинх Процедура ДСП_ЗафиксироватьЗамерыАсинх() Экспорт
	
	//Передаем управление в вызывающий код,
	// чтобы избежать серверного вызова внутри события ПередЗавершением
	Ждать 1; 
	
	ЗаписатьРезультатыАвто();
	
КонецПроцедуры

#КонецОбласти

